# AnalyticConstructionName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyThermalProperties..::..AnalyticConstructionName Property
FamilyThermalProperties Class See Also
---
The construction gbXML name. This value corresponds to the 'Name' property of a constructionType node in Constructions.xml.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string AnalyticConstructionName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AnalyticConstructionName As String
	Get
```

Visual C++
---
```text
public:
property String^ AnalyticConstructionName {
	String^ get ();
}
```

# See Also
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace